---
kind: property
id: P:Autodesk.Revit.DB.ExternalDefinition.HideWhenNoValue
source: html/5d90af6c-9cca-1064-c240-6c1eb3277a88.htm
---
# Autodesk.Revit.DB.ExternalDefinition.HideWhenNoValue Property

Indicates whether this parameter should be hidden from the properties palette when it has no value.

## Syntax (C#)
```csharp
public bool HideWhenNoValue { get; set; }
```

## Remarks
Even when hidden, the parameter can still be accessed directly via the API.